<?php
/* setting name server */
$warzname = "เฟรนซี ‼ Talk💯Trade พัฒนาโดย ‼ ANIC-STUDIO ";
$server  ="เฟรนซี ‼ Talk💯Trade พัฒนาโดย ‼ ANIC-STUDIO";
$title  ="เฟรนซี ‼ Talk💯Trade พัฒนาโดย ‼ ANIC-STUDIO";
/* setting login and pass */
//login md5
$login_md5 = false; //ใช้md5 ให้ใส่ true ไม่ใช้md5 ใส่ false
$login_key = 'g5sc4gs1fz0h'; //ไม่ต้องแก้ไข

$Cpass = "changepass"; //เปลี่ยนรหัสผ่าน หากมองเห้นรหัสผ่านให้ใช้ changepass หากพาสมั่วให้ใช้ changepassmd5

/* setting link facebook all */
$facebookgroup = "https://www.facebook.com/groups/956623958066098/";
$facebookadmin = "https://www.facebook.com/suttipong.chaimontree.75";

/* setting donwload */
$downloadfullv1 = "https://bit.ly/3iN7kwJ";
$downloadfullv2 = "https://bit.ly/2CqzaxO";
$downloadfullv3 = "https://bit.ly/2W4M0J1";

/* setting new tab */
$New = "เฟรนซี ‼ Talk💯Trade พัฒนาโดย ‼ ANIC-STUDIO"; //ข้อความหน้าเว็บแท็ปเล็กๆ

/* setting photo all */
$photopromo = "assets/image/โปรโมชั่นo.png"; // ภาพโปรโมชั่น
$photochar = "assets/image/123.png"; // ภาพโปรโมชั่นตัวละคร

//$photostar = "assets/image/2.png"; //ภาพโปรโมชั่นเช่าดาว

$icon = "assets/image/iconZ.png"; // แสดงส่วนหัว title และ  สถานะเซิฟเวอร์
$logo = "assets/image/Logo.png";//logo บนเว็บ
$photologxgc = "assets/image/gcx8.png"; // gcx2.png คือคูร2 gcx1.png คือไม่คูณ
$photorandom = "assets/image/สุ่มเว็ป.png"; // ภาพโปรโมชั่นสุ่มไอเทม
$photoyoutube = "assets/image/ตามนักสตรีม.png"; // ภาพโปรโมชั่นตามนักสตีม
$photobacara ="assets/image/A.png"; // ภาพโปณโมท
$photowelcome="assets/image/Z.png";// ภาพหัวรันเชอร์
$photowelcomev2="assets/image/logologin.png";// ภาพหัวรันเชอร์

//จำนวนวันเช่าดาวที่จะได้รับในแต่ละราคาบัตร
$_CONFIG['STAR'][50] = 2;
$_CONFIG['STAR'][90] = 5;
$_CONFIG['STAR'][150] = 10;
$_CONFIG['STAR'][300] = 20;
$_CONFIG['STAR'][500] = 30;
$_CONFIG['STAR'][1000] = 365;

/* จำนวนวันที่ได้รับ โชว์หน้าเว็บไซต์ */
$tmt_star50 = "2"; //บัตร 50 แสดงหน้าเว็บ
$tmt_star90 = "5"; //บัตร 90 แสดงหน้าเว็บ
$tmt_star150 = "10"; //บัตร 150 แสดงหน้าเว็บ
$tmt_star300 ="20"; //บัตร 400 แสดงหน้าเว็บ
$tmt_star500 = "30"; //บัตร 500 แสดงหน้าเว็บ
$tmt_star1000 = "365"; //บัตร 1000 แสดงหน้าเว็บ



/* setting numtextname จำนวนตัวอักษรสำหรับเปลี่ยนชื่อ เช่น 20 ตัว */
$maxtext = "10";

$rcpoints = "1"; // สิทธิ์ ในการเปลี่ยนสีชื่อตัวละคร
$rnpoints = "1"; //สิทธิ์ในการเปลี่ยนชื่อตัวละคร

/* db name color */
$dbcolor = "GlowName"; //ตาราง db

						/* color name  */
//    หมายเลขสีตาม sql 				โค้ดสีแสดงบนเว็บ				        ชื่อสีที่แสดงบนเว็บใช้บอกผู้เล่น
$colorname1 = "1";      $codecolor1 = "FF0000";		 $colornamergb1 = "แดง";
$colorname2 = "2";      $codecolor2 = "FF9900";		 $colornamergb2 = "ส้ม";
$colorname3 = "3";      $codecolor3 = "66FFFF";		 $colornamergb3 = "ฟ้า";
$colorname4 = "4";      $codecolor4 = "66FF33";		 $colornamergb4 = "เขียว";
$colorname5 = "5";      $codecolor5 = "3333FF";		 $colornamergb5 = "นํ้าเงิน";
$colorname6 = "6";      $codecolor6 = "6633CC";		 $colornamergb6 = "ม่วง";
$colorname7 = "7";      $codecolor7 = "666666";		 $colornamergb7 = "เทา";
$colorname8 = "8";      $codecolor8 = "3300CC";		 $colornamergb8 = "นํ้าเงินเข้ม";
$colorname9 = "9";      $codecolor9 = "FF33CC";		 $colornamergb9 = "ชมพู";
$colorname10 = "10";    $codecolor10 = "FFCC00";	 $colornamergb10 = "ทอง";
$colorname11 = "11";    $codecolor11 = "FFFF00";	 $colornamergb11 = "เหลือง";
$colorname12 = "12";    $codecolor12 = "33FF00";	 $colornamergb12 = "เขียวเข้ม";
//$colorname13 = "13";    $codecolor13 = "RGB";	 $colornamergb13 = "RGB";

/*******************  ระบบเติมเงิน1 *******************/
$APIPASSKEY	= 'OPAL147'; // apipasskey ตั้งเองได้ตาม tmtopup
$TMTUID	= '222129';// หมายเลข uid tmt

$Rategc = "4"; //อัตราเติมเงินคูณ แสดงหน้าเว็บ
/* ระบบเติมเงิน2 จำนวน GC ที่ได้รับ โชว์หน้าเว็บไซต์ */
$tmt50 = "50000"; //บัตร 50 แสดงหน้าเว็บ
$tmt90 = "90000"; //บัตร 90 แสดงหน้าเว็บ
$tmt150 = "150000"; //บัตร 150 แสดงหน้าเว็บ
$tmt300 ="300000"; //บัตร 400 แสดงหน้าเว็บ
$tmt500 = "550000"; //บัตร 500 แสดงหน้าเว็บ
$tmt1000 = "1200000"; //บัตร 1000 แสดงหน้าเว็บ

$Ratecp = "1"; //อัตราเติมเงินคูณ แสดงหน้าเว็บ
/* ระบบเติมเงิน2 จำนวน GC ที่ได้รับ โชว์หน้าเว็บไซต์ */
$tmtcp50 = "50"; //บัตร 50 แสดงหน้าเว็บ
$tmtcp90 = "90"; //บัตร 90 แสดงหน้าเว็บ
$tmtcp150 = "150"; //บัตร 150 แสดงหน้าเว็บ
$tmtcp300 ="300"; //บัตร 400 แสดงหน้าเว็บ
$tmtcp500 = "500"; //บัตร 500 แสดงหน้าเว็บ
$tmtcp1000 = "1000"; //บัตร 1000 แสดงหน้าเว็บ

/*********** ระบบสุ่มไอเท็ม***********/
//'100002'=>20
// 100002 คือ ไอเท็มไอดีแล้วต้องตั้งชื่อรูปเป็นไอเท็มไอดีด้วย
// 20 คือ %ที่จะสุ่มได้
$item_rand_array = array(
	'0' => 100,	//NO - ไม่ต้องเปลี่ยน
	
	'100335' => 0.5,  '200268' => 0.5,   '200269' => 0.5, 
	'200256' => 0.5,    '200257' => 0.5,     '100329' => 0.5, 
	'200267' => 0.5,  '200266' => 0.5,   '100334' => 0.5,
	'200274' => 0.5,    '200275' => 0.5,     '100338' => 0.5,
	'103020' => 60,   '600015' => 0.5,
	'200254' => 0.5,   '200255' => 0.5,    '100328' => 0.5,
	'200250' => 50,   '200251' => 50,    '100326' => 50,
	'200252' => 0.5,   '200253' => 0.5,    '100327' => 0.5,
	'200262' => 0.5,  '200263' => 0.5,   '100332' => 0.5,
	'200264' => 0.5,  '200265' => 0.5,   '100333' => 0.5,
	'300400' => 80,   '300401' => 80,
	
);

$item_rand_eachtime = 25000; // GC ที่ใช้สุ่ม

/*******************  ระบบซื้อไอเทมGC *******************/
$buyitem = array(
array("test"=>1),//ไม่ต้องลบอันนี้

//====================== ตัวอย่าง การตั้งค่าของระบบซื้อของ
//array("gc"=>"100", << ส่วนนี้คือ ราคาซื้อ 100 GC ก็ใส่ 100
//"title"=>"Medkit", << ส่วนนี้คือชื่อ Item นั้นๆ
//"image"=>"http://img.online-station.net/gamewiki/infestation/medicineitem/3/1002_sss_3.png", << ส่วนนี้คือลิงค์รูปภาพ
//"itemid"=>"101304", << ส่วนนี้คือ ItemID
//"amount"=>"50"), << ส่วนนี้คือ จำนวน
//======================

array("gc"=>"1000",
"title"=>"AWM .338 Magnum ammo",
"image"=>"assets/image/shop/400003.png",
"itemid"=>"400003",
"amount"=>"5000",
"storeamount"=>"9999"),

array("gc"=>"1000",
"title"=>".50 BMG",
"image"=>"assets/image/shop/400002.png",
"itemid"=>"400002",
"amount"=>"5000",
"storeamount"=>"9999"),

array("gc"=>"1000",
"title"=>"12 Gauge Slug",
"image"=>"assets/image/shop/400005.png",
"itemid"=>"400005",
"amount"=>"5000",
"storeamount"=>"9999"),

array("gc"=>"1000",
"title"=>"VSS-20",
"image"=>"assets/image/shop/400007.png",
"itemid"=>"400007",
"amount"=>"5000",
"storeamount"=>"9999"),

array("gc"=>"1000",
"title"=>".308 Winchester",
"image"=>"assets/image/shop/400009.png",
"itemid"=>"400009",
"amount"=>"5000",
"storeamount"=>"9999"),

array("gc"=>"1000",
"title"=>"Bandages DX",
"image"=>"assets/image/shop/Item_bandage_02.png",
"itemid"=>"100800",
"amount"=>"5000",
"storeamount"=>"9999"),

array("gc"=>"1000",
"title"=>"WoodShield",
"image"=>"assets/image/shop/100900.png",
"itemid"=>"100900",
"amount"=>"5000",
"storeamount"=>"9999"),

array("gc"=>"1500000",
"title"=>"IChigoHood",
"image"=>"assets/image/shop/600023.png",
"itemid"=>"600023",
"amount"=>"1",
"storeamount"=>"30"),

array("gc"=>"3000000",
"title"=>"Box_3M_PHLuXun",
"image"=>"assets/image/shop/102920.png",
"itemid"=>"102920",
"amount"=>"1",
"storeamount"=>"20"),

array("gc"=>"4500000",
"title"=>"Box_4.5M_Saitama",
"image"=>"assets/image/shop/102921.png",
"itemid"=>"102921",
"amount"=>"1",
"storeamount"=>"7"),

array("gc"=>"3500000",
"title"=>"Mikutron",
"image"=>"assets/image/shop/600026.png",
"itemid"=>"600026",
"amount"=>"1",
"storeamount"=>"7"),

array("gc"=>"3500000",
"title"=>"Box_3.5M_PHGWBlue",
"image"=>"assets/image/shop/102924.png",
"itemid"=>"102924",
"amount"=>"1",
"storeamount"=>"10"),

array("gc"=>"5000000",
"title"=>"TPTravis",
"image"=>"assets/image/shop/600014.png",
"itemid"=>"600014",
"amount"=>"1",
"storeamount"=>"5"),

array("gc"=>"4500000",
"title"=>"Box_4.5M_Banana",
"image"=>"assets/image/shop/102925.png",
"itemid"=>"102925",
"amount"=>"1",
"storeamount"=>"7"),

array("gc"=>"2000000",
"title"=>"TsunaYS",
"image"=>"assets/image/shop/600030.png",
"itemid"=>"600030",
"amount"=>"1",
"storeamount"=>"25"),

); // ห้ามลบ และห้ามวางหลังตัวนี้ให้วางภายในของตัวนี้เท่านั้น
unset($buyitem[0]);// ห้ามลบ
/********************************/

?>
