<?php
/*******************  ระบบเช่าตัวละคร *******************/
$tradeall = array(
    array("test"=>1),//ไม่ต้องลบอันนี้
    
    //====================== ตัวอย่าง การตั้งค่าของระบบเช่าตัวละคร
    //array("amta"=>"100", << ส่วนนี้คือ ราคาเช่า 100 cp ก็ใส่ 100
    //"title"=>"Medkit", << ส่วนนี้คือชื่อ ตัวละคร นั้นๆ
    //"image"=>"https://hilight.kapook.com/img_cms2/user/settawoot/A/a1_122.jpg", << ส่วนนี้คือลิงค์รูปภาพ
    //"itemid"=>"101304", << ส่วนนี้คือ ItemID ของตัวละคร
    //"day"=>"50"), << ส่วนนี้คือ จำนวน วันเช่าตัวละคร
    //======================
    
	
    /*array("amta"=>"1000",
    "title"=>"เติมสะสมMythic",
    "image"=>"assets/image/shop1/gundam.png",
    "rowtrade"=>"1",
    "detail"=>"เซ็ตที่ 1"),*/
	
	/*array("amta"=>"1000",
    "title"=>"เติมสะสมMythic ไหม่",
    "image"=>"assets/image/shop1/VENHELLSINGF.png",
    "rowtrade"=>"2",
    "detail"=>"เซ็ตที่ 2"),*/


    ); // ห้ามลบ และห้ามวางหลังตัวนี้ให้วางภายในของตัวนี้เท่านั้น
    unset($tradeall[0]);// ห้ามลบ
/********************************/

?>